lib/tasks/dev.rake

  task add_default_admin: :environment do
    Admin.create!(
      email: 'admin@ativos.com',
      password: DEFAULT_PASSWORD,
      password_confirmation: DEFAULT_PASSWORD
    )
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task add_types: :environment do
    file_name = 'types.txt'
    file_path = File.join(DEFAULT_FILE_PATH, file_name)

    File.open(file_path, 'r').each do |line|
      Type.create!(description: line.strip)
---
INSERT INTO "types" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "NOTEBOOK"], ["created_at", "2022-01-21 18:17:32.997783"], ["updated_at", "2022-01-21 18:17:32.997783"]]