app/controllers/admins_ativo/areas_controller.rb

SELECT  "areas".* FROM "areas" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    @areas = Area.all.page(params[:page])

INSERT INTO "areas" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "CTI"], ["created_at", "2022-02-05 01:44:31.041788"], ["updated_at", "2022-02-05 01:44:31.041788"]]
---
  def create
    @area = Area.new(params_area)
    if @area.save()