app/controllers/admins_ativo/ativos_controller.rb

  def index
    if params[:search]
      @ativos = Ativo.includes(:type).search(params[:search]).page(params[:page])
---
SELECT  "ativos".* FROM "ativos" WHERE (tombo LIKE '%16197%' OR description LIKE '%16197%' OR serial LIKE '%16197%') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "types".* FROM "types" WHERE "types"."id" IN (?, ?)  [["id", 2], ["id", 3]]
SELECT COUNT(*) FROM "ativos" WHERE (tombo LIKE '%%' OR description LIKE '%%' OR serial LIKE '%%')

  def create
    @ativo = Ativo.new(params_ativo)
    if @ativo.save()
---
INSERT INTO "ativos" ("type_id", "description", "serial", "tombo", "specification", "invoice", "date_acquisition", "warranty", "ata", "bidding", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @ativo.update(params_ativo)
---
UPDATE "ativos" SET "specification" = ?, "invoice" = ?, "warranty" = ?, "ata" = ?, "bidding" = ?, "updated_at" = ? WHERE "ativos"."id" = ?  [["specification", "hshrjsryj"], ["invoice", "syjyrsj"], ["warranty", "srjsrs"], ["ata", "yrj"], ["bidding", "sjr"], ["updated_at", "2022-01-26 14:31:43.877189"], ["id", 1]]

  def destroy
    if @ativo.destroy
---
DELETE FROM "ativos" WHERE "ativos"."id" = ?  [["id", 20]]

  def set_ativo
    @ativo = Ativo.find(params[:id])
---
SELECT  "ativos".* FROM "ativos" WHERE "ativos"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]

  def set_type_options
    @type_options = Type.all.pluck(:description, :id)
---
SELECT "types"."description", "types"."id" FROM "types"