app/controllers/admins_ativo/conditions_controller.rb

  def index
    @conditions = Condition.all
---
SELECT "conditions".* FROM "conditions"

  def create
    @condition = Condition.new(params_condition)
    if @condition.save()
---
INSERT INTO "conditions" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "VINCULADO"], ["created_at", "2022-02-05 01:46:00.717101"], ["updated_at", "2022-02-05 01:46:00.717101"]]