app/controllers/admins_ativo/situations_controller.rb

SELECT "conditions".* FROM "conditions" WHERE "conditions"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "situations".* FROM "situations"
---
  def index
    @situations = Situation.includes(:condition)

INSERT INTO "situations" ("condition_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["condition_id", 1], ["description", "EM USO"], ["created_at", "2022-02-05 01:46:14.453679"], ["updated_at", "2022-02-05 01:46:14.453679"]]
---
  def create
    @situation = Situation.new(params_situation)
    if @situation.save()

SELECT "conditions"."description", "conditions"."id" FROM "conditions"
---
  def set_condition_options
    @condition_options = Condition.all.pluck(:description, :id)