app/controllers/admins_ativo/subareas_controller.rb

SELECT  "subareas".* FROM "subareas" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    @subareas = Subarea.includes(:area).page(params[:page])

INSERT INTO "subareas" ("description", "area_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "SERVICE DESK"], ["area_id", 1], ["created_at", "2022-02-05 01:44:46.125037"], ["updated_at", "2022-02-05 01:44:46.125037"]]
---
  def create
    @subarea = Subarea.new(params_subarea)
    if @subarea.save()

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_subarea
    @subarea = Subarea.find(params[:id])

SELECT "areas"."description", "areas"."id" FROM "areas"
---
  def set_area_options
    @area_options = Area.all.pluck(:description, :id)