app/controllers/admins_ativo/types_controller.rb

  def index
    @types = Type.all.page(params[:page])
---
SELECT  "types".* FROM "types" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "types"

  def set_type
    @type = Type.find(params[:id])
---
SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]