app/controllers/admins_ativo/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    @users = User.all.page(params[:page])

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fulano"], ["created_at", "2022-01-25 19:03:57.732099"], ["updated_at", "2022-01-25 19:03:57.732099"]]
---
  def create
    @user = User.new(params_user)
    if @user.save()

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Cicero do Nascimento Sousa"], ["updated_at", "2022-01-25 19:04:05.285030"], ["id", 3]]
---
  def update
    if @user.update(params_user)