app/controllers/admins_ativo/vinculos_controller.rb

SELECT "subareas".* FROM "subareas" WHERE "subareas"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 3], ["id", 4]]
SELECT "vinculos".* FROM "vinculos"
---
  def index
    @vinculos = Vinculo.includes(:user, :area, :subarea)

SELECT "ativos".* FROM "ativos"
SELECT "conditions".* FROM "conditions"
SELECT "situations".* FROM "situations"
---
  def new
    @vinculo = Vinculo.new
    #@addativos = @vinculo.addativos.build
    @ativos = Ativo.all
    @conditions = Condition.all
    @situations = Situation.all

SELECT "ativos".* FROM "ativos"
SELECT "conditions".* FROM "conditions"
SELECT "situations".* FROM "situations"
INSERT INTO "vinculos" ("user_id", "area_id", "subarea_id", "detvinculo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["area_id", 1], ["subarea_id", 1], ["detvinculo", "Teste"], ["created_at", "2022-02-09 20:37:20.847577"], ["updated_at", "2022-02-09 20:37:20.847577"]]
---
  def create
    @ativos = Ativo.all
    @conditions = Condition.all
    @situations = Situation.all
    @vinculo = Vinculo.new(params_vinculo)
    if @vinculo.save()

SELECT "ativos".* FROM "ativos"
SELECT "conditions".* FROM "conditions"
SELECT "situations".* FROM "situations"
---
  def edit
    @ativos = Ativo.all
    @conditions = Condition.all
    @situations = Situation.all

UPDATE "vinculos" SET "detvinculo" = ?, "updated_at" = ? WHERE "vinculos"."id" = ?  [["detvinculo", "Teste"], ["updated_at", "2022-02-09 11:50:31.991298"], ["id", 5]]
---
  def update
    if @vinculo.update(params_vinculo)

DELETE FROM "vinculos" WHERE "vinculos"."id" = ?  [["id", 5]]
---
  def destroy
    if @vinculo.destroy

SELECT  "vinculos".* FROM "vinculos" WHERE "vinculos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_vinculo
    @vinculo = Vinculo.find(params[:id])

SELECT "users"."name", "users"."id" FROM "users"
---
  def set_user_option
    @user_option = User.all.pluck(:name, :id)

SELECT "areas"."description", "areas"."id" FROM "areas"
---
  def set_area_option
    @area_option = Area.all.pluck(:description, :id)

SELECT "subareas"."description", "subareas"."id" FROM "subareas"
---
  def set_subarea_option
    @subarea_option = Subarea.all.pluck(:description, :id)